GP_Master/ImprovementsFound.org
** Original 
/home/bck/source/locoGP/GP_Master/Seed-iaik.ascon128v11.Ascon128v11.java
#+begin_src java -n
package iaik.ascon128v11;



public class Ascon128v11 {

  // Defines
  public static int CRYPTO_KEYBYTES = 16;
  public static int CRYPTO_NSECBYTES = 0;
  public static int CRYPTO_NPUBBYTES = 16;
  public static int CRYPTO_ABYTES = 16;
  public static int CRYPTO_NOOVERLAP = 1;

  public static boolean PRINTSTATE = false;

  public static long ROTR(long x, int n) {
    return Long.rotateRight(x, n);
  }


  public static long load64(byte S[]) {
    long x = 0;
    x = java.nio.ByteBuffer.wrap(S).getLong();

    return x;
  }

  public static void store64(byte S[], int offset, long x) {
    int i;

    for (i = 0; i < 8; ++i) {
      byte byteacter[] = java.nio.ByteBuffer.allocate(8).putLong(x).array();
      S[i + offset] = (byte) byteacter[i];
    }
  }

  public static void permutation(byte S[], int rounds) {
    long i;
    long x0 = 0, x1 = 0, x2 = 0, x3 = 0, x4 = 0;
    long t0, t1, t2, t3, t4;

    x0 = load64(java.util.Arrays.copyOfRange(S, 0, 8));
    x1 = load64(java.util.Arrays.copyOfRange(S, 8, 16));
    x2 = load64(java.util.Arrays.copyOfRange(S, 16, 24));
    x3 = load64(java.util.Arrays.copyOfRange(S, 24, 32));
    x4 = load64(java.util.Arrays.copyOfRange(S, 32, 40));

    for (i = 0; i < rounds; ++i) {
      // addition of round constant
      x2 ^= (((long) (0xf) - i) << 4) | i;
      // substitution layer
      x0 ^= x4;    x4 ^= x3;    x2 ^= x1;
      t0  = x0;    t1  = x1;    t2  = x2;    t3  = x3;    t4  = x4;
      t0 =~ t0;    t1 =~ t1;    t2 =~ t2;    t3 =~ t3;    t4 =~ t4;
      t0 &= x1;    t1 &= x2;    t2 &= x3;    t3 &= x4;    t4 &= x0;
      x0 ^= t1;    x1 ^= t2;    x2 ^= t3;    x3 ^= t4;    x4 ^= t0;
      x1 ^= x0;    x0 ^= x4;    x3 ^= x2;    x2 =~ x2;
      // linear diffusion layer
      x0 ^= ROTR(x0, 19) ^ ROTR(x0, 28);
      x1 ^= ROTR(x1, 61) ^ ROTR(x1, 39);
      x2 ^= ROTR(x2, 1) ^ ROTR(x2, 6);
      x3 ^= ROTR(x3, 10) ^ ROTR(x3, 17);
      x4 ^= ROTR(x4, 7) ^ ROTR(x4, 41);
    }
    store64(S, 0, x0);
    store64(S, 8, x1);
    store64(S, 16, x2);
    store64(S, 24, x3);
    store64(S, 32, x4);
  }

  public static int crypto_aead_decrypt(byte m[], int mlen, byte nsec[], byte c[], int clen, byte ad[],
      int adlen, byte npub[], byte k[]) {

    mlen = 0;
    if (clen < CRYPTO_KEYBYTES)
      return -1;

    int klen = CRYPTO_KEYBYTES;
    int size = 320 / 8;
    int capacity = 2 * klen;
    int rate = size - capacity;
    int a = 12;
    int b = (klen == 16) ? 6 : 8;
    int s = adlen / rate + 1;
    int t = (clen - klen) / rate + 1;
    int l = (clen - klen) % rate;

    byte S[] = new byte[size];
    byte A[] = new byte[(int) (s * rate)];
    byte M[] = new byte[(int) (t * rate)];
    int i, j;

    // pad associated data
    for (i = 0; i < adlen; ++i)
      A[i] = ad[i];
    A[adlen] = (byte) 0x80;
    for (i = adlen + 1; i < s * rate; ++i)
      A[i] = 0;

    // initialization
    S[0] = (byte) (klen * 8);
    S[1] = (byte) (rate * 8);
    S[2] = (byte) a;
    S[3] = (byte) b;
    for (i = 4; i < rate; ++i)
      S[i] = 0;
    for (i = 0; i < klen; ++i)
      S[rate + i] = k[i];
    for (i = 0; i < klen; ++i)
      S[rate + klen + i] = npub[i];
    permutation(S, a);
    for (i = 0; i < klen; ++i)
      S[rate + klen + i] ^= k[i];

    // process associated data
    if (adlen != 0) {
      for (i = 0; i < s; ++i) {
        for (j = 0; j < rate; ++j)
          S[j] ^= A[i * rate + j];
        permutation(S, b);
      }
    }
    S[size - 1] ^= 1;

    // process plaintext
    for (i = 0; i < t - 1; ++i) {
      for (j = 0; j < rate; ++j) {
        M[i * rate + j] = (byte) (S[j] ^ c[i * rate + j]);
        S[j] = c[i * rate + j];
      }
      permutation(S, b);
    }
    for (j = 0; j < l; ++j)
      M[(int) ((t - 1) * rate + j)] = (byte) (S[j] ^ c[(int) ((t - 1) * rate + j)]);
    for (j = 0; j < l; ++j)
      S[j] = c[(int) ((t - 1) * rate + j)];
    S[l] ^= 0x80;

    // finalization
    for (i = 0; i < klen; ++i)
      S[rate + i] ^= k[i];
    permutation(S, a);
    for (i = 0; i < klen; ++i)
      S[rate + klen + i] ^= k[i];

    // return -1 if verification fails
    for (i = 0; i < klen; ++i)
      if (c[clen - klen + i] != S[rate + klen + i])
        return -1;

    // return plaintext
    mlen = clen - klen;
    for (i = 0; i < mlen; ++i)
      m[i] = M[i];

    return mlen;
  }
}

#+end_src

* References

** Ascon
http://ascon.iaik.tugraz.at/implementation.html


* Script to show improvements found

#+begin_src sh :results raw :shebang #!/bin/bash
baseDir='/home/bck/source/locoGP/GP_Master'

# Seed-iaik.ascon128v11.Ascon128v11.java 
seedFiles=( $(find $baseDir/Seed-*.java) )

# optimisedFiles=( "iaik.ascon128v11.Ascon128v11_21587.java" )
# optimisedFiles=( "iaik.ascon128v11.Ascon128v11_340.java" )
# optimisedFiles=( "iaik.ascon128v11.Ascon128v11_2833.java" )
optimisedFiles=( "iaik.ascon128v11.Ascon128v11_52876.java" )
# echo ${seedFiles[@]}


compareFiles(){
    # aFile=$2
    expNum=$(echo $2 | awk -F$3 '{ print $2 }' | awk -F. '{ print $1}'  )
    # echo $2 $expNum

    echo -e "\n\nDiff\n\n"
    echo "#+begin_src diff"
    diff $1 <(sed "s/$expNum//g" $2)  
    echo "#+end_src"

    echo -e "\n\nDiff side-by-side\n\n"
    echo "#+begin_src diff"
    diff -wy -W180 $1 <(sed "s/$expNum//g" $2)  
    echo "#+end_src"

    # | grep -v Problem | grep -v '^---'  | grep -v ^1c1 
    # meld $1 $2
}

for seedFile in ${seedFiles[@]}
do

  problemName=$( echo $seedFile | awk -F- '{ print $2 }' | awk -F.java '{ print $1 }' )
  echo -e "\n\n\n* $problemName"

  for aFile in $(echo ${optimisedFiles[@]} | grep $problemName)
  do 
#    diffName=$(echo $aFile | awk -F\/ '{ print $NF }' )    
    diffName=$(echo $aFile | awk -F\/ '{ print $NF }' | awk -F\.java '{ print $1 }' )    
    echo "** $diffName"
    echo -e "Improvement Details:\n\n"

    echo "#+begin_src"
    # grep -A1 /home/bck/GP/Exhaustive/optimisedList.txt
    grep -m1 "\ $diffName\ " $baseDir/*nfo.log | grep \ =\  | tr '\n' '\n\n' | sed 's/[0-9][0-9][0-9][0-9]\/[0-9][0-9]\/[0-9][0-9]\ [0-9][0-9]:[0-9][0-9]:[0-9][0-9]:[0-9][0-9][0-9]\ //g' 
    echo "#+end_src"

    compareFiles $seedFile $aFile $problemName
  done

    echo "** Original - $seedFile"
    echo "#+begin_src java -n"
    cat $seedFile
    echo "#+end_src"

done
#+end_src

#+RESULTS:






