GP_Master/ImprovementsFound.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> References</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Ascon</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="http://ascon.iaik.tugraz.at/implementation.html">http://ascon.iaik.tugraz.at/implementation.html</a>
</p>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Script to show improvements found</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ffff00;">baseDir</span>=<span style="color: #00ff00;">'/home/bck/source/locoGP/GP_Master'</span>

<span style="color: #ff0000;"># </span><span style="color: #ff0000;">Seed-iaik.ascon128v11.Ascon128v11.java </span>
<span style="color: #ffff00;">seedFiles</span>=( $(<span style="color: #ff00ff;">find</span> $<span style="color: #ffff00;">baseDir</span>/Seed-*.java) )

<span style="color: #ff0000;"># </span><span style="color: #ff0000;">optimisedFiles=( "iaik.ascon128v11.Ascon128v11_21587.java" )</span>
<span style="color: #ff0000;"># </span><span style="color: #ff0000;">optimisedFiles=( "iaik.ascon128v11.Ascon128v11_340.java" )</span>
<span style="color: #ff0000;"># </span><span style="color: #ff0000;">optimisedFiles=( "iaik.ascon128v11.Ascon128v11_2833.java" )</span>
<span style="color: #ffff00;">optimisedFiles</span>=( <span style="color: #00ff00;">"iaik.ascon128v11.Ascon128v11_52876.java"</span> )
<span style="color: #ff0000;"># </span><span style="color: #ff0000;">echo ${seedFiles[@]}</span>


<span style="color: #0000ff; font-weight: bold;">compareFiles</span>(){
    <span style="color: #ff0000;"># </span><span style="color: #ff0000;">aFile=$2</span>
    <span style="color: #ffff00;">expNum</span>=$(<span style="color: #ff00ff;">echo</span> $<span style="color: #ffff00;">2</span> | awk -F$<span style="color: #ffff00;">3</span> <span style="color: #00ff00;">'{ print $2 }'</span> | awk -F. <span style="color: #00ff00;">'{ print $1}'</span>  )
    <span style="color: #ff0000;"># </span><span style="color: #ff0000;">echo $2 $expNum</span>

    <span style="color: #0000ff; font-weight: bold;">echo</span> -e <span style="color: #00ff00;">"\n\nDiff\n\n"</span>
    <span style="color: #0000ff; font-weight: bold;">echo</span> <span style="color: #00ff00;">"#+begin_src diff"</span>
    diff $<span style="color: #ffff00;">1</span> &lt;(sed <span style="color: #00ff00;">"s/$expNum//g"</span> $<span style="color: #ffff00;">2</span>)  
    <span style="color: #0000ff; font-weight: bold;">echo</span> <span style="color: #00ff00;">"#+end_src"</span>

    <span style="color: #0000ff; font-weight: bold;">echo</span> -e <span style="color: #00ff00;">"\n\nDiff side-by-side\n\n"</span>
    <span style="color: #0000ff; font-weight: bold;">echo</span> <span style="color: #00ff00;">"#+begin_src diff"</span>
    diff -wy -W180 $<span style="color: #ffff00;">1</span> &lt;(sed <span style="color: #00ff00;">"s/$expNum//g"</span> $<span style="color: #ffff00;">2</span>)  
    <span style="color: #0000ff; font-weight: bold;">echo</span> <span style="color: #00ff00;">"#+end_src"</span>

    <span style="color: #ff0000;"># </span><span style="color: #ff0000;">| grep -v Problem | grep -v '^---'  | grep -v ^1c1 </span>
    <span style="color: #ff0000;"># </span><span style="color: #ff0000;">meld $1 $2</span>
}

<span style="color: #00ffff; font-weight: bold;">for</span> seedFile<span style="color: #00ffff; font-weight: bold;"> in</span> ${<span style="color: #ffff00;">seedFiles</span>[@]}
<span style="color: #00ffff; font-weight: bold;">do</span>

  <span style="color: #ffff00;">problemName</span>=$( <span style="color: #0000ff; font-weight: bold;">echo</span> $<span style="color: #ffff00;">seedFile</span> | awk -F- <span style="color: #00ff00;">'{ print $2 }'</span> | awk -F.java <span style="color: #00ff00;">'{ print $1 }'</span> )
  <span style="color: #0000ff; font-weight: bold;">echo</span> -e <span style="color: #00ff00;">"\n\n\n* $problemName"</span>

  <span style="color: #00ffff; font-weight: bold;">for</span> aFile<span style="color: #00ffff; font-weight: bold;"> in</span> $(<span style="color: #ff00ff;">echo</span> ${<span style="color: #ffff00;">optimisedFiles</span>[@]} | grep $<span style="color: #ffff00;">problemName</span>)
  <span style="color: #00ffff; font-weight: bold;">do</span> 
<span style="color: #ff0000;">#    </span><span style="color: #ff0000;">diffName=$(</span><span style="color: #ff00ff;">echo</span><span style="color: #ff0000;"> $aFile | awk -F\/ '{ print $NF }' )    </span>
    <span style="color: #ffff00;">diffName</span>=$(<span style="color: #ff00ff;">echo</span> $<span style="color: #ffff00;">aFile</span> | awk -F<span style="color: #00ff00;">\/</span> <span style="color: #00ff00;">'{ print $NF }'</span> | awk -F<span style="color: #00ff00;">\.</span>java <span style="color: #00ff00;">'{ print $1 }'</span> )    
    <span style="color: #0000ff; font-weight: bold;">echo</span> <span style="color: #00ff00;">"** $diffName"</span>
    <span style="color: #0000ff; font-weight: bold;">echo</span> -e <span style="color: #00ff00;">"Improvement Details:\n\n"</span>

    <span style="color: #0000ff; font-weight: bold;">echo</span> <span style="color: #00ff00;">"#+begin_src"</span>
    <span style="color: #ff0000;"># </span><span style="color: #ff0000;">grep -A1 /home/bck/GP/Exhaustive/optimisedList.txt</span>
    grep -m1 <span style="color: #00ff00;">"\ $diffName\ "</span> $<span style="color: #ffff00;">baseDir</span>/*nfo.log | grep <span style="color: #00ff00;">\ </span>=<span style="color: #00ff00;">\ </span> | tr <span style="color: #00ff00;">'\n'</span> <span style="color: #00ff00;">'\n\n'</span> | sed <span style="color: #00ff00;">'s/[0-9][0-9][0-9][0-9]\/[0-9][0-9]\/[0-9][0-9]\ [0-9][0-9]:[0-9][0-9]:[0-9][0-9]:[0-9][0-9][0-9]\ //g'</span> 
    <span style="color: #0000ff; font-weight: bold;">echo</span> <span style="color: #00ff00;">"#+end_src"</span>

    compareFiles $<span style="color: #ffff00;">seedFile</span> $<span style="color: #ffff00;">aFile</span> $<span style="color: #ffff00;">problemName</span>
  <span style="color: #00ffff; font-weight: bold;">done</span>

    <span style="color: #0000ff; font-weight: bold;">echo</span> <span style="color: #00ff00;">"** Original - $seedFile"</span>
    <span style="color: #0000ff; font-weight: bold;">echo</span> <span style="color: #00ff00;">"#+begin_src java -n"</span>
    cat $<span style="color: #ffff00;">seedFile</span>
    <span style="color: #0000ff; font-weight: bold;">echo</span> <span style="color: #00ff00;">"#+end_src"</span>

<span style="color: #00ffff; font-weight: bold;">done</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brendan Cody-Kenny</p>
<p class="date">Created: 2018-01-15 Mon 22:32</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
